"""
Напишите программу, которая вводит символьную строку, определяет в ней самую длинную цепочку
подряд стоящих символов и выводит ее на экран. Если таких цепочек несколько, выводит любую из них.
Пример 1:
Введите строку: ABCABC
Ответ: A
Пример 2:
Введите строку: CBBACAABC
Ответ: BB
Пример 3:
Введите строку: BBBBBB
Ответ: BBBBBB
"""
s = input()
cnt = 0
c_max = s[0]
l_max = 1
l = 1
for i in range(1, len(s)):
    if s[i - 1] == s[i]:
        l += 1
    if s[i - 1] != s[i] or i == len(s) - 1:
        if l > l_max:
            c_max = s[i - 1]
            l_max = l
            l = 1
print(c_max * l_max)
